// 所有題目與選項資料
//八個倉鼠:番鼠	嚇鼠	鼠勾以	鼠巴拉西	煩惱鼠	鼠來寶	ㄎㄧㄤ鼠	邊緣子
export const questions = [
  {
    //第一題
    text: "某天睜開眼睛突然發現自己變成倉鼠了？！你會...？",
    options: [
      {
        text: "睡回去，一定是自己還沒睡醒",
        scores: { 煩惱鼠: 3, 鼠巴拉西: 1, 邊緣子: 2 },
      },
      {
        text: "蛤？？？！？！！太扯了吧",
        scores: { 嚇鼠: 3, 鼠勾以: 2, 鼠巴拉西: 1 },
      },
      {
        text: "酷欸！那我是誰",
        scores: { ㄎㄧㄤ鼠: 3, 番鼠: 3, 鼠來寶: 3, 鼠巴拉西: 1 },
      },
    ],
    img: "/img/Q/Q1.png",
  },
  {
    //第二題
    text: "出了自己的窩，發現前面有一小堆葵花籽，你會...？",
    options: [
      {
        text: "吃的欸！",
        scores: { 番鼠: 3, ㄎㄧㄤ鼠: 1, 鼠來寶: 2, 鼠巴拉西: 1 },
      },
      {
        text: "可能有詐！（小心奕奕試探",
        scores: { 嚇鼠: 3, 鼠勾以: 2, 煩惱鼠: 1 },
      },
      { text: "無視", scores: { 鼠巴拉西: 3, 邊緣子: 2, 煩惱鼠: 1 } },
    ],
    img: "/img/Q/Q2.png",
  },
  {
    //第三題
    text: "來確認一下自己到底在哪裡好了…你會？",
    options: [
      {
        text: "往被木屑擋住的水管口探索",
        scores: { 嚇鼠: 3, 煩惱鼠: 2, 鼠巴拉西: 1, 邊緣子: 1 },
      },
      {
        text: "前往那個有一堆沙子的地方",
        scores: { 鼠勾以: 3, ㄎㄧㄤ鼠: 3, 鼠來寶: 2 },
      },
      {
        text: "看起來像是通往高處的樓梯？",
        scores: { 番鼠: 1, 邊緣子: 1, 鼠巴拉西: 2 },
      },
    ],
    img: "/img/Q/Q3.png",
  },
  {
    //第四題
    text: " 確認了被關在籠子裡（廢話），發現籠子沒關好…你會…？",
    options: [
      { text: "出去看看吧？", scores: { 番鼠: 3, 鼠巴拉西: 2, ㄎㄧㄤ鼠: 2 } },
      { text: "出去感覺就會鼠…", scores: { ㄎㄧㄤ鼠: 2, 嚇鼠: 3, 邊緣子: 1 } },
      {
        text: "在門口探索看看好了",
        scores: { 鼠勾以: 3, 煩惱鼠: 2, 邊緣子: 1, 鼠來寶: 2 },
      },
    ],
    img: "/img/Q/Q4.png",
  },
  {
    //第五題
    text: "發現遠處看起來有鏡子！去看看自己到底長怎樣吧！",
    options: [
      {
        text: "前往",
        scores: {
          番鼠: 0,
          嚇鼠: 0,
          鼠勾以: 0,
          鼠巴拉西: 0,
          煩惱鼠: 0,
          鼠來寶: 0,
          ㄎㄧㄤ鼠: 0,
          邊緣子: 0,
        },
      },
    ],
    img: "/img/Q/Q5.png",
  },
  {
    //第六題
    text: "前往的道路被一個不明物體擋住了！！！你會...？",
    options: [
      {
        text: "使用蠻力叼走",
        scores: { 番鼠: 2, ㄎㄧㄤ鼠: 3, 鼠巴拉西: 3, 鼠來寶: 1 },
      },
      {
        text: "看看有沒有其他路好了",
        scores: { 鼠勾以: 3, 嚇鼠: 3, 煩惱鼠: 3, 邊緣子: 3 },
      },
      { text: "爬上去看看！", scores: { 番鼠: 3, 鼠來寶: 3 } },
    ],
    img: "/img/Q/Q6.png",
  },
  {
    //第七題
    text: "成功繼續向前走，發現了一個跑輪…",
    options: [
      {
        text: "跑看看是什麼感覺好了",
        scores: { 番鼠: 3, 鼠來寶: 3, 鼠勾以: 2 },
      },
      {
        text: "無視他繼續往前",
        scores: { 嚇鼠: 3, 煩惱鼠: 3, 邊緣子: 3 },
      },
      { text: "試圖往滾輪上爬（？", scores: { ㄎㄧㄤ鼠: 3, 鼠巴拉西: 3 } },
    ],
    img: "/img/Q/Q7.png",
  },
  {
    //第八題
    text: "終於到鏡子前面了！你是.....",
    options: [
      {
        text: "生成結果",
        scores: {
          番鼠: 0,
          嚇鼠: 0,
          鼠勾以: 0,
          鼠巴拉西: 0,
          煩惱鼠: 0,
          鼠來寶: 0,
          ㄎㄧㄤ鼠: 0,
          邊緣子: 0,
        },
      },
    ],
    img: "/img/Q/Q8.png",
  },
];
